cf/Documents/ПризовыеОчки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПризовыеОчки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОборотыПоПризовымОчкам</xr:Item>
				<xr:Item>AccumulationRegister.ПризовыеОчки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Очки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОчков</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПризовыхОчков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ПризовыеОчки/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Автор, Ответственный, Сотрудник
	|ИЗ
	|	Документ.ПризовыеОчки
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	|ВЫБРАТЬ
	|	Ссылка.Месяц Период, &ВидДвиженияПриход ВидДвижения, Ссылка.Отдел Отдел, Ссылка.Подразделение Подразделение, Ссылка.Сотрудник, Количество
	|ИЗ 
	|	Документ.ПризовыеОчки.Очки 
	|ГДЕ 
	|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Ссылка.Месяц Период, Ссылка.Отдел Отдел, Ссылка.Подразделение Подразделение, Ссылка.Сотрудник, ВидОчков, Количество
	|ИЗ 
	|	Документ.ПризовыеОчки.Очки 
	|ГДЕ 
	|	Ссылка = &Ссылка
	|");
	

	//Запрос.УстановитьПараметр("Область", 		ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	
	ДополнительныеСвойства.Вставить("ПризовыеОчки", Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ОборотыПоПризовымОчкам", Пакет[3].Выгрузить());
	
	                       
КонецПроцедуры
